app/views/contacts/show.html.erb

SELECT "groups".* FROM "groups"
---
<p>Group:
<% if @contact.group_id.present? %>

SELECT "stories".* FROM "stories" WHERE "stories"."contact_id" = 4 ORDER BY updated_at desc
---
</br>
<% if @contact.stories.present?%>