app/controllers/contacts_controller.rb

SELECT "groups".* FROM "groups"
SELECT "stories".* FROM "stories"
SELECT "contacts".* FROM "contacts" WHERE (LOWER(first_name) LIKE '%od%' OR LOWER(last_name) LIKE '%od%' OR LOWER(email) LIKE '%od%' OR LOWER(adjective) LIKE '%od%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "contacts" WHERE (LOWER(first_name) LIKE '%od%' OR LOWER(last_name) LIKE '%od%' OR LOWER(email) LIKE '%od%' OR LOWER(adjective) LIKE '%od%')
---
  def index

    @contact = Contact.new
    @user = User.new
    @groups = Group.all
    @stories = Story.all
    @group = Group.new

    # if params[:keyword].present? & params[:search].present?
    #       @contacts = Contact.where("LOWER(#{params[:search]}) LIKE ?", "%#{params[:keyword].downcase}%")



    if params[:keyword].present?
      @contacts = Contact.where("LOWER(first_name) LIKE ? OR LOWER(last_name) LIKE ? OR LOWER(email) LIKE ? OR LOWER(adjective) LIKE ?","%#{params[:keyword].downcase}%","%#{params[:keyword].downcase}%","%#{params[:keyword].downcase}%","%#{params[:keyword].downcase}%") #&& Contact.where("(user_id) = #{session[:userid]}")
      @contacts = @contacts.page(params[:page]).per(5)

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "stories".* FROM "stories" WHERE "stories"."contact_id" = 4 ORDER BY updated_at desc
SELECT "stories".* FROM "stories" WHERE "stories"."contact_id" = 1
---
  def show
    @contact = Contact.find(params[:id])
    @stories = @contact.stories.order("updated_at desc")
    # @contact.stories = Story.find(params[:contact_id])

    if @contact.twitter.present?

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "contacts" ("address", "adjective", "city", "created_at", "email", "first_name", "group_id", "job_title", "last_name", "nickname", "phone", "photo_content_type", "photo_file_name", "photo_file_size", "state", "twitter", "updated_at", "user_id", "we_chatted_about", "we_met_at", "we_met_on", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(params[:contact])
    @contact.user = User.find(session[:userid])
    # @contact = @user.contact.create(params[:contact])
    if params[:keyword].present?
      @new = Contact.new(:first_name => params[:keyword])
      @new.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "contacts" SET "last_name" = '', "nickname" = '', "job_title" = '', "phone" = '', "email" = '', "twitter" = '', "address" = '', "city" = '', "state" = '', "zip" = '', "we_met_at" = '', "we_met_on" = '', "we_chatted_about" = '', "adjective" = '', "updated_at" = '2012-06-15 05:00:31.763634' WHERE "contacts"."id" = 2
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])