app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
    @members = Contact.find_all_by_group_id(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."group_id" = 1

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("contact_id", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["contact_id", nil], ["created_at", Fri, 15 Jun 2012 08:07:44 UTC +00:00], ["name", ""], ["updated_at", Fri, 15 Jun 2012 08:07:44 UTC +00:00], ["user_id", nil]]

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 8]]