app/controllers/stories_controller.rb

  def new
    @story = Story.new
    @story.contact = Contact.find(params[:contact_id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @story = Story.new(params[:story])
    # @story.contact = Contact.find(params[:contact_id])

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("contact_id", "convo", "created_at", "date", "updated_at") VALUES (?, ?, ?, ?, ?)  [["contact_id", 2], ["convo", "We talked about dogs"], ["created_at", Fri, 15 Jun 2012 05:17:06 UTC +00:00], ["date", Fri, 15 Jun 2012], ["updated_at", Fri, 15 Jun 2012 05:17:06 UTC +00:00]]

  def destroy
    @story = Story.find(params[:id])
    @contact = @story.contact_id
    @story.destroy
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 2]]